package operator;

public class OperatorAdd2 {

	public static void main(String[] args) {

		// ++ 증가 --감소
			/* 전위, 후위 증감연산자
			 * 증감 연산자는 피연산자 앞에 두거나 뒤에 둘 수 있으며, 연산자의 위치에 따라 수행되는 시점이 달라진다
			 * ++a: 증감 연산자를 피연산자 앞에 둘 수 있따. 이것을 앞에 있따고 해서 전위(Prefix) 증감 연산자라 한다.
			 * a++: 증감 연산자를 피연산자 뒤에 둘 수 있따. 이것을 뒤에 있따고 해서 후위(Postfix) 증감 연산자라 한다.
			 * 
			 * */
		int a = 1;
		int b = 0;
		
		b = ++a; //a의 값을 먼저 증가시키고, 그 결과를 b에 대입
		System.out.println("a = " + a + ", b= " + b);
		
		// 후위 증감 연산자 사용 예
		a = 1; // a 값을 다시 1로 지정
		b = 0; // b 값을 다시 0으로 지정
		
		b = a++; //a의 현재 값을 b에 먼저 대입하고, 그 후 a 값을 증가시킴
		System.out.println("a = " + a + ", b = " + b); // 결과: a = 2, b = 1
		// 증감 연산자가 변수 앞에 오는 경우를 전위 증감 연산자라고 하며, 이 경우에는 증감연산이 먼저 수행된 후 나머지 연산이 수행된다.
		// 증감 연산자가 변수 뒤에 오는 경우를 후위 증감 연산자라고 하며, 이경우 후위 증감 연산자라고 하며, 이경우에는 다른 연산이 먼저 수행된 후 증감 연산이 수행된다.
		
		++a;
		System.out.println("a = " + a);
		a++;
		System.out.println("a = " + a);

	}

}
